Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: The idea is that the extension autoconfigures things for the user, eliminating a lot of boilerplate - we can just `@Inject` a `Tracer` wherever it is needed. Now imagine that in our application we would like to utilize the configured `Tracer`, but we need to customize it a little, for example by providing a custom `Reporter`. The only thing that would be needed in our application would be something like the following:
ja_jp: アイデアは、エクステンションがユーザーのために自動設定を行い、多くのボイラープレートを排除するということです。必要な場所であれば、 `@Inject` を `Tracer` にすることができます。私たちのアプリケーションで、設定された `Tracer` を利用しようとする場合は、、カスタムの `Reporter` を提供するなど、少しカスタマイズする必要があります。アプリケーションで必要になるのは、次のようなものだけです。

source: The image chosen for JIB now depends on the Java version you target.
ja_jp: JIBに使用されるイメージは、ターゲットとするJavaのバージョンによって変化するようになりました。

source: The image that will be used in the generated manifests will be `quarkus/demo-app:1.0`
ja_jp: 生成されたマニフェストで使用されるイメージは `quarkus/demo-app:1.0` となります

source: The image we are going to build needs to be named accordingly to work with Heroku's registry and deployment. We get the generated name via `heroku info` and pass it on to the (local) build:
ja_jp: これからビルドするイメージは、Heroku のレジストリーやデプロイメントと連携するために、適切な名前を付ける必要があります。`heroku info` を通して生成された名前を取得し、それを (ローカル) ビルドに渡します。

source: The image, image pull policy, service account, volumes, mounts and additional environment variables are inherited/copied from the deployment resource. Any customization to the original deployment resource (via configuration or extension) will also be reflected in the job.
ja_jp: イメージ、イメージプルポリシー、サービスアカウント、ボリューム、マウント、および追加の環境変数は、デプロイメントリソースから継承/コピーされます。 元の配置リソースを(設定またはエクステンションによって)カスタマイズした場合も、ジョブに反映されます。

source: The implementation class of ServiceUrlProvider used to generate ServiceUrl.
ja_jp: ServiceUrl を生成する ServiceUrlProvider の実装クラスです。

source: The implementation is pretty straightforward and you just need to define your endpoints using the JAX-RS annotations and use the `FruitService` to list/add new fruits.
ja_jp: 実装はとても簡単で、JAX-RSのアノテーションを使ってエンドポイントを定義し、 `FruitService` を使って新しいフルーツをリストアップ/追加するだけです。

source: The implementation is pretty straightforward and you just need to define your endpoints using the JAX-RS annotations.
ja_jp: 実装は非常に簡単で、JAX-RSのアノテーションを使ってエンドポイントを定義するだけです。

source: The implementation is pretty straightforward and you just need to define your endpoints using the Jakarta REST annotations and use the `FruitService` to list/add new fruits.
ja_jp: 実装は非常に簡単で、Jakarta RESTアノテーションを使ってエンドポイントを定義し、 `FruitService` を使って新しいフルーツをリストアップ/追加するだけでよいのです。

source: The implementation is pretty straightforward, and you just need to define your endpoints using the JAX-RS annotations and use the `FruitService` to list/add new fruits.
ja_jp: 実装はとても簡単で、JAX-RSのアノテーションを使ってエンドポイントを定義し、 `FruitService` を使って新しいフルーツをリスト/追加するだけです。

source: The implementation is pretty straightforward, and you just need to define your endpoints using the JAX-RS annotations.
ja_jp: 実装は非常に簡単で、 JAX-RS のアノテーションを使ってエンドポイントを定義するだけです。

source: The implementation is pretty straightforward, and you just need to define your endpoints using the Jakarta REST annotations and use the `FruitService` to list/add new fruits.
ja_jp: 実装は非常に簡単で、Jakarta RESTアノテーションを使ってエンドポイントを定義し、 `FruitService` を使って新しい果物をリストアップ/追加するだけです。

source: The implementation is pretty straightforward, and you just need to define your endpoints using the Jakarta REST annotations.
ja_jp: 実装は非常に簡単で、Jakarta RESTアノテーションを使用してエンドポイントを定義するだけです。

source: The implementation of that fragment looks like this:
ja_jp: そのフラグメントの実装は次のようになります。

source: The implementation of the `project(Class)` method uses the constructor's parameter names to build the select clause of the query, so the compiler must be configured to store parameter names inside the compiled class. This is enabled by default if you are using the Quarkus Maven archetype. If you are not using it, add the property `<maven.compiler.parameters>true</maven.compiler.parameters>` to your `pom.xml`.
ja_jp: `project(Class)` メソッドの実装では、コンストラクタのパラメータ名を使用してクエリの select 節を構築するため、コンパイルされたクラスの中にパラメータ名を格納するようにコンパイラを設定する必要があります。Quarkus Mavenアーキタイプを使用している場合はデフォルトで有効になっています。使用していない場合はプロパティ `<maven.compiler.parameters>true</maven.compiler.parameters>` を `pom.xml` に追加してください。

source: The implementation of the `project(Class)` method uses the constructor's parameter names to build the select clause of the query, so the compiler must be configured to store parameter names inside the compiled class. This is enabled by default if you are using the Quarkus Maven archetype. If you are not using it, add the property `<maven.compiler.parameters>true</maven.compiler.parameters>` to your pom.xml.
ja_jp: `project(Class)` メソッドの実装では、コンストラクタのパラメータ名を使用してクエリーの select 節を構築するため、コンパイルされたクラスの中にパラメータ名を格納するようにコンパイラを設定する必要があります。Quarkus Mavenアーキタイプを使用している場合はデフォルトで有効になっています。使用していない場合はプロパティ `<maven.compiler.parameters>true</maven.compiler.parameters>` を `pom.xml` に追加してください。

source: The important elements are these 2 options that were automatically added by Quarkus:
ja_jp: 重要なのは、Quarkusによって自動的に追加された以下の2つのオプションです。

source: The important part is the following option that was automatically added by Quarkus:
ja_jp: 重要なのは、Quarkusによって自動的に追加された以下のオプションです。

source: The important thing to note is the use of the https://kotlinlang.org/docs/reference/compiler-plugins.html#all-open-compiler-plugin[all-open] Kotlin compiler plugin. In order to understand why this plugin is needed, first we need to note that by default all the classes generated from the Kotlin compiler are marked as `final`.
ja_jp: 注意すべき重要なこととして、 link:https://kotlinlang.org/docs/reference/compiler-plugins.html#all-open-compiler-plugin[all-open] Kotlinコンパイラーのプラグインを使用していることです。なぜこのプラグインが必要なのかを理解するためには、まず、Kotlin コンパイラから生成されるクラスはデフォルトで `final` でマークされていることに注目してください。

source: The importmap is generated by the `{web-locator-ga}` extension, and available at `/_importmap/generated_importmap.js`. This means adding the following to your `index.html` will allow you to import web libraries by name:
ja_jp: importmap は `{web-locator-ga}` エクステンションで生成され、。 `/_importmap/generated_importmap.js` で利用できます。 つまり、 `index.html` に以下を追加すると、Web ライブラリーを名前でインポートできるようになります。

source: The in-memory connector only transmits objects (payloads or configured messages) sent using the `InMemorySource#send` method. Messages received by the application methods won't contain connector-specific metadata.
ja_jp: in-memory コネクターは、`InMemorySource#send` メソッドを使用して送信されたオブジェクト (ペイロードまたは設定されたメッセージ) のみを送信します。 アプリケーションメソッドによって受信されるメッセージには、コネクター固有のメタデータは含まれません。

source: The incoming messages are acknowledged only once the processing completes successfully. So, it commits the offset after the successful processing. If the processing still fails, even after all retries, the message is _nacked_ and the failure strategy is applied.
ja_jp: 着信メッセージは、処理が正常に完了したときにのみ確認応答されます。したがって、着信メッセージは、処理が成功した後にオフセットをコミットします。それでも処理が失敗する場合は、すべての再試行後でも、メッセージは _nack_ され、エラーストラテジーが適用されます。

source: The incoming method can also receive `Message<List<Payload>>`, `KafkaRecordBatch<Key, Payload>` `ConsumerRecords<Key, Payload>` types. They give access to record details such as offset or timestamp:
ja_jp: 着信メソッドは、 `Message<List<Payload>>`、 `KafkaRecordBatch<Key, Payload>` `ConsumerRecords<Key, Payload>` タイプを受信することもできます。これらは、オフセットやタイムスタンプなどのレコードの詳細へのアクセスを提供します。

source: The incoming method can also receive `Message<List<Payload>>`, `Message<ConsumerRecords<Key, Payload>>`, and `ConsumerRecords<Key, Payload>` types. They give access to record details such as offset or timestamp:
ja_jp: 受信メソッドは、 `Message<List<Payload>>`、 `Message<ConsumerRecords<Key, Payload>>`、 `ConsumerRecords<Key, Payload>` タイプも受け取ることができます。 これらは、オフセットやタイムスタンプなどのレコードの詳細情報へのアクセスを提供します。

source: The index of scanned classes will not automatically include your external class dependencies. To add dependencies, create a `@BuildStep` that produces `IndexDependencyBuildItem` objects, for a `groupId` and `artifactId`.
ja_jp: スキャンされたクラスのインデックスには、外部クラスの依存関係が自動的に含まれることはありません。依存関係を追加するには、 `groupId` と `artifactId` に対して `IndexDependencyBuildItem` オブジェクトを生成する `@BuildStep` を作成します。

source: The indexed property is sorted by their index before being added to the target `Collection`. Any gaps contained in the indexes do not resolve to the target `Collection`, which means that the `Collection` result will store all values without any gaps.
ja_jp: インデックス付きのプロパティーは、ターゲットの `Collection` に追加される前に、インデックスで並べ替えられます。インデックスに含まれるギャップはターゲットの `Collection` に解決されません。つまり、 `Collection` の結果にはギャップのないすべての値が格納されます。

source: The indexed property syntax uses the property name and square brackets `[ ] with an index in between.
ja_jp: インデックス付きプロパティーの構文では、プロパティー名と大かっこ [ ] を使用し、その間にインデックスを付けます。

source: The individual OIDC endpoint URLs that you may need to configure depends on the OIDC <<application-type>> and expected token formats.
ja_jp: 設定が必要な個別の OIDC エンドポイント URL は、 OIDC の <<application-type>> と期待されるトークン形式に依存します。

source: The infamous ClassTooLargeException
ja_jp: 悪名高き ClassTooLargeException

source: The infix notation is only supported if parentheses are used for grouping, e.g. `price=(order.price + 10)` is equivalent to `price=order.price.plus(10)`.
ja_jp: 中置記法は、括弧を使用してグループ化する場合にのみサポートされます。例えば、 `price=(order.price + 10)` は `price=order.price.plus(10)` と同等です。

source: The information about all the available Quarkus extensions is provided to the dev tools by __Quarkus extension registries__.
ja_jp: 利用可能なすべてのQuarkusエクステンションに関する情報は、 _Quarkus extension registries_ によって開発ツールに提供されます。

source: The information from the client certificate can be used to add roles to Quarkus `SecurityIdentity`.
ja_jp: クライアント証明書の情報を使用して、Quarkus `SecurityIdentity` にロールを追加できます。

source: The information from the client certificate can be used to enhance Quarkus `SecurityIdentity`. For example, one can add new roles after checking a client certificate subject name, and so on. Please see the xref:security-customization.adoc#security-identity-customization[SecurityIdentity Customization] section for more information about customizing Quarkus `SecurityIdentity`.
ja_jp: クライアント証明書の情報は、Quarkus `SecurityIdentity` を強化するために使用できます。例えば、クライアント証明書のサブジェクト名を確認した後に新しいロールを追加することなどができます。Quarkus `SecurityIdentity` のカスタマイズの詳細については、 link:security-customization.html#security-identity-customization[SecurityIdentity Customization]のセクションを参照してください。。

source: The information from the client certificate can be used to enhance Quarkus `SecurityIdentity`. For example, one can add new roles after checking a client certificate subject name, etc. Please see the xref:security-customization.adoc#security-identity-customization[SecurityIdentity Customization] section for more information about customizing Quarkus `SecurityIdentity`.
ja_jp: クライアント証明書の情報は、Quarkusの `SecurityIdentity` を強化するために使用することができます。例えば、クライアント証明書のサブジェクト名をチェックした後に、新しいロールを追加することなどができます。 Quarkus `SecurityIdentity` のカスタマイズに関する詳細については、xref:security-customization.adoc#security-identity-customization[SecurityIdentityのカスタマイズ]セクションを参照してください。

source: The initial push is rather big, as all layers of the image need to be transferred. The following pushes will be smaller.
ja_jp: イメージの全レイヤーを転送する必要があるため、最初のプッシュはかなり大きくなります。 それ以降のプッシュは小さくなります。

source: The initial set of tested components is derived from the test class:
ja_jp: テスト対象コンポーネントの初期セットは、テストクラスから派生します。

source: The initial version of the Quarkus Superheroes application was released in early February 2022. Several microservices co-exist to form a larger system, communicating synchronously via REST or event-driven via https://kafka.apache.org[Apache Kafka^]. Some of the applications are reactive, while others are more traditional, showcasing how to build each kind.
ja_jp: Quarkus Superheroesアプリケーションの初期バージョンは、2022年2月初旬にリリースされました。いくつかのマイクロサービスが共存してより大きなシステムを形成しており、RESTを介して同期的に通信したり、 link:https://kafka.apache.org[Apache Kafka, window=_blank]を介してイベントドリブンで通信したりしています。アプリケーションの中にはリアクティブなものもあれば、伝統的なものもあり、それぞれの種類の構築方法を紹介しています。

source: The initially requested heartbeat interval (seconds), zero for none Type: _int_
ja_jp: 最初に要求されたハートビート間隔 (秒)、ゼロの場合はなし Type: _int_

source: The initially requested maximum channel number Type: _int_
ja_jp: 最初に要求された最大チャネル数 Type: _int_

source: The injected Vert.x instance provides a set of APIs you can use. The one we are going to use in this section is the Vert.x File System. It provides a non-blocking API to access files.
ja_jp: インジェクションされたVert.xインスタンスは、利用可能なAPIのセットを提供します。このセクションで使用するのはVert.x File Systemです。これは、ファイルにアクセスするためのノンブロッキングAPIを提供します。

source: The injected `EntityManager` or `Session` instance is a proxy that requires an active transaction for interaction.
ja_jp: 注入された `EntityManager` または `Session` インスタンスはプロキシーであり、操作にはアクティブなトランザクションが必要です。

source: The injected `JsonWebToken` (JWT) bean has an `@IdToken` qualifier, which means it represents not an access token but OIDC `ID token`. `IdToken` provides information in the form of claims about the current user authenticated during the OIDC authorization code flow and you can use `JsonWebToken` API to access these claims.
ja_jp: 注入された `JsonWebToken` (JWT) Bean には `@IdToken` 修飾子があります。これは、アクセストークンではなく OIDC `ID トークン` であることを意味します。 `IdToken` は、OIDC 認可コードフローで認証された現行ユーザーに関する情報をクレームの形式で提供します。これらのクレームには、 `JsonWebToken` API を使用してアクセスできます。

source: The injected `ManagedExecutor` uses the Quarkus thread pool.
ja_jp: 注入された `ManagedExecutor` は、Quarkus のスレッドプールを使用しています。

source: The injected `UniAsserter` argument is used to make assertions.
ja_jp: 注入された `UniAsserter` 引数はアサーションを行うために使用されます。

source: The injected `WasmQuarkusContext` bean configures `Instance.Builder` to use `MachineFactory` and `WasmModule` instances, which are created dynamically, based on the application configuration and execution environment.
ja_jp: インジェクトされた `WasmQuarkusContext` Bean は、アプリケーションの設定と実行環境に基づいて動的に作成される `MachineFactory` および `WasmModule` インスタンスを使用するように `Instance.Builder` を構成します。

source: The injected `birthdate` claim is directly used to construct the response.
ja_jp: 挿入された `birthdate` クレームは、応答を構築するために直接使用されます。

source: The injected instance is an _immutable list_ of the contextual references of the _disambiguated_ beans.
ja_jp: 注入されたインスタンスは、_disambiguated_ bean のコンテキスト参照の _immutable list_ です。

source: The injection of a configured `org.jboss.logging.Logger` logger instance with the `@Inject` annotation is another alternative to adding an application logger, but is applicable only to CDI beans.
ja_jp: `@Inject` アノテーションで設定された `org.jboss.logging.Logger` ロガーインスタンスの注入は、 アプリケーションロガーを追加するもう一つの選択肢ですが、 CDI Beanにのみ適用できます。

source: The inlined key
ja_jp: インラインキー

source: The input class can also have nested bean classes. Expanding on the previous example:
ja_jp: 入力クラスは、入れ子になった Bean クラスを持つこともできます。前の例を拡張します。

source: The input your function receives is:
ja_jp: 関数が受け取る入力は次のとおりです。

source: The inspiration behind Quarkus...
ja_jp: Quarkus のインスピレーション

source: The installed command can be now executed using `quarkus kill`.
ja_jp: インストールされたコマンドは、 `quarkus kill` を使用して実行できます。

source: The installed extension must be consistent with the `quarkus.datasource.db-kind` you define in your datasource configuration.
ja_jp: インストールされているエクステンションは、データソースの設定で定義する `quarkus.datasource.db-kind` と一致している必要があります。

source: The instructions here are exactly as above with one change: you'll need to add `native` as the first parameter to the `manage.sh` script:
ja_jp: ここでの説明は上記と全く同じですが、1つ変更点があります: `manage.sh` スクリプトの最初のパラメーターとして `native` を追加する必要があります。

source: The instrumentation documented in this section has been tested with Quarkus and works in both standard and native mode.
ja_jp: このセクションで説明されている計装は、Quarkus でテストされており、標準モードとネイティブモードの両方で動作します。

source: The instrumentation for JVM metrics uses JFR events and not all native VM implementations support the listed events. For more details, please see https://github.com/open-telemetry/opentelemetry-java-instrumentation/tree/main/instrumentation/runtime-telemetry/runtime-telemetry-java17/library[OpenTelemetry's Runtime Telemetry Java 17 documentation].
ja_jp: JVM メトリクスの計装には JFR イベントが使用されますが、すべてのネイティブ VM 実装がリストされたイベントをサポートしているわけではありません。詳細については、 https://github.com/open-telemetry/opentelemetry-java-instrumentation/tree/main/instrumentation/runtime-telemetry/runtime-telemetry-java17/library[OpenTelemetry の Runtime Telemetry Java 17 ドキュメント] を参照してください。

source: The integration is currently only available for Maven applications. link:https://github.com/quarkusio/quarkus/issues/40361[Gradle integration] will follow up.
ja_jp: 現在、この統合は Maven アプリケーションでのみ利用可能です。 リンク:https://github.com/quarkusio/quarkus/issues/40361[Gradle 統合] が後に続きます。

source: The integration of Mutiny in Quarkus goes beyond just the library. Mutiny exposes hooks that allow Quarkus and Mutiny to be closely integrated:
ja_jp: QuarkusにおけるMutinyのインテグレーションは、単なるライブラリにとどまりません。Mutinyは、QuarkusとMutinyを密接に統合するためのフックを公開しています。

source: The integration with OCI is not supported.
ja_jp: OCIとの統合はサポートされていません。

source: The integration with https://jbang.dev[jbang] now supports enabling development mode and can use Quarkus platforms (BOM) for version management. For this you need to use jbang v0.62+.
ja_jp: link:https://jbang.dev[jbang]との統合は、開発モードの有効化をサポートするようになり、バージョン管理にQuarkusプラットフォーム(BOM)を使用できるようになりました。このためには、jbang v0.62+を使用する必要があります。

source: The interaction using WebSocket initiates with an HTTP request employing the 'Upgrade' header to transition to the WebSocket protocol. Instead of a `200 OK` response, the server replies with a `101 Switching Protocols` response to upgrade the HTTP connection to a WebSocket connection. Following this successful handshake, the TCP socket utilized in the initial HTTP upgrade request remains open, allowing both client and server to exchange messages in both direction continually.
ja_jp: WebSocket を使用したやり取りは、WebSocket プロトコルに移行するための 'Upgrade' ヘッダーを使用する HTTP リクエストで開始されます。 サーバーは、 `200 OK` レスポンスの代わりに `101 Switching Protocols` レスポンスを返し、HTTP 接続を WebSocket 接続へとアップグレードします。 このハンドシェイクが成功すると、最初の HTTP アップグレードリクエストで使用された TCP ソケットは開いたままとなり、クライアントとサーバーの双方が継続的に双方向のメッセージをやり取りできるようになります。

source: The intercepted class should be https://jakarta.ee/specifications/cdi/4.1/jakarta-cdi-spec-4.1#unproxyable[proxyable] and therefore should not be `final`, should not have non-private `final` methods, and should have a non-private zero-parameter constructor. If it isn't, a bytecode transformation will attempt to fix it if <<unproxyable_classes_transformation,enabled>>, but note that adding a zero-parameter constructor is not always possible.
ja_jp: インターセプトされたクラスは https://jakarta.ee/specifications/cdi/4.1/jakarta-cdi-spec-4.1#unproxyable[proxyable] である必要があるため、 `final` や、プライベート以外の `final` メソッドを指定できません。また、プライベート以外のゼロパラメーターのコンストラクターを指定する必要があります。 そうでなく、<<unproxyable_classes_transformation,enabled>> の場合は、バイトコード変換によって修正を試みます。ゼロパラメーターのコンストラクターを追加できない場合もあることに注意してください。

source: The interceptor binding annotation is put on a bean class so that all business methods are intercepted. The annotation can also be put on individual methods, in which case, only the annotated methods are intercepted.
ja_jp: インターセプター・バインディング・アノテーションをBeanクラスに付けると、すべてのビジネス・メソッドがインターセプトされるようになります。 アノテーションは個々のメソッドに付けることもでき、その場合、アノテーションされたメソッドのみがインターセプトされます。

source: The interceptor binding annotation is used to bind our interceptor to a bean. Simply annotate a bean class with `@Logged`, as in the following example.
ja_jp: インターセプターバインディングアノテーションは、インターセプターをBeanにバインドするために使用されます。次の例のように Beanクラスに `@Logged` をアノテーションするだけです。

source: The interceptor bindings of the resulting interceptor are specified by annotating the method with the interceptor binding types.
ja_jp: 結果として得られるインターセプターのインターセプターバインディングは、メソッドにインターセプターバインディングタイプをアノテーション付けすることによって指定されます。

source: The interceptor chain is applied before any conversion is performed on the configuration value.
ja_jp: インターセプターチェーンは、設定値の変換が行われる前に適用されます。

source: The interceptor class is automatically considered a tested component.
ja_jp: インターセプタークラスは自動的にテスト対象コンポーネントと見なされます。

source: The interceptor-created counter will have the "extra" dimension tag with value "annotated"
ja_jp: インターセプターが作成したカウンターには、値が "annotated" の "extra" ディメンションタグが付きます。

source: The interceptor-created timer will have the "region" dimension tag with value "test"
ja_jp: インターセプターが作成したタイマーには、値が "test" の "region" ディメンションタグが付きます。

source: The interesting part comes with the addition of a search endpoint. In our `LibraryResource`, we just need to add the following method (and a few ``import``s):
ja_jp: 興味深いのは、検索エンドポイントが追加された点です。 `LibraryResource` では、次のメソッド (およびいくつかの ``import``) を追加する必要があるだけです。

source: The interesting part is the last parameter. It's a function, a callback to be more precise, that gets called when the operation completes or fails. Indeed, the asynchronous nature of Vert.x does not allow using `try/catch` blocks. So you need to pass a continuation callback, invoked with the outcome.
ja_jp: 興味深いのは最後のパラメーターです。これは関数、より正確にはコールバックで、操作が完了したときや失敗したときに呼び出されます。実際、Vert.xの非同期の性質上、 `try/catch` ブロックを使用することはできません。そのため、結果に応じて呼び出される継続コールバックを渡す必要があります。

source: The interesting part starts when running the application as a native executable:
ja_jp: 興味深いのは、アプリケーションをネイティブ実行可能ファイルとして実行するときです。

source: The interval (in seconds) between two reconnection attempts Type: _int_
ja_jp: 2 回の再接続試行の間隔 (秒) Type: _int_

source: The interval in second between two reconnection attempts Type: _int_
ja_jp: 2 回の再接続試行の間隔 (秒) タイプ: _int_

source: The introduction of the `/q/info` endpoint exposing information about your application
ja_jp: アプリケーションの情報を公開する `/q/info` エンドポイントの導入

source: The invocation duration, memory, and billed duration with a full startup during the warmup phase and the preloading of the classes.
ja_jp: ウォームアップフェーズとクラスのプリロード中にフル起動した場合の起動時間、メモリ、課金時間。

source: The invocation duration, memory, and billed duration without SnapStart
ja_jp: SnapStartを使用しない場合の起動時間、メモリ、課金期間

source: The invoke method
ja_jp: invoke メソッド

source: The io.quarkus.logging.Log class provides the same methods as JBoss Logging, but as static methods.
ja_jp: `io.quarkus.logging.Log` クラスは JBoss Logging と同じメソッドを提供しますが、これらは静的メソッドです。

source: The issuer-based resolution is enabled with the `quarkus.oidc.resolve-tenants-with-issuer` property. For example:
ja_jp: issuer ベースの解決は、`quarkus.oidc.resolve-tenants-with-issuer` プロパティーで有効になります。例:

source: The item produced by the returned `Uni` can be:
ja_jp: 返された `Uni` によって生成されるアイテムは以下のとおりです。

source: The item to note here is that the restarted service received the completion notification (`completing ...`). The result of the request to run a recovery cycle is a json array of recovering LRAs (in this example the list is empty because the last LRA has now finished as indicated by the empty json array `[]`).
ja_jp: ここで注意すべき点は、再起動したサービスが完了通知を受け取ったことです( `completing …​`)。復旧サイクルの実行要求の結果は、復旧したLRAのjson配列です（この例では、最後のLRAが終了したため、リストは空のjson配列 `[]` ）。

source: The iteration metadata prefix is configurable either via `EngineBuilder.iterationMetadataPrefix()` for standalone Qute or via the `quarkus.qute.iteration-metadata-prefix` configuration property in a Quarkus application. Three special constants can be used:
ja_jp: 反復処理メタデータの接頭辞は、スタンドアロンの Qute では `EngineBuilder.iterationMetadataPrefix()` によって、Quarkus アプリケーションでは `quarkus.qute.iteration-metadata-prefix` 設定プロパティーによって設定することができます。以下の 3 つの特別な定数を使用することができます。

source: The job container is pretty similar to the application container, and the only thing that changes is the configured environment variables. More specifically, the following environment variable is added, to tell the job to exit right after initialization.
ja_jp: ジョブコンテナはアプリケーションコンテナとよく似ていて、変わるのは設定された環境変数だけです。 具体的には、初期化直後にジョブを終了させるために次の環境変数が追加されます。

source: The job is scheduled once the `JobDefinition#schedule()` method is called.
ja_jp: `JobDefinition#schedule()` メソッドが呼び出されると、ジョブがスケジュールされます。
